package com.edu.edusystem.fragment_study;

import com.edu.edusystem.R;

public class stu_data {
    public static String[] stu_home_icon={String.valueOf(R.drawable.course),String.valueOf(R.drawable.community),String.valueOf(R.drawable.knowledgepoint)};
    public static String[] stu_home_title={"选好课","答疑社区","日积月累"};
    public static String[] stu_home_intro={"好课专享折扣,精彩立即拥有","你问我答,专治各种不会","语文必备知识点，每天进步多一点"};

    public static String[] title={"诗歌类——意象",
            "诗歌类——人物形象",
            "诗歌类——事物形象",
            "诗歌类——景物形象",
    };
    public static String[] content={"1.送别类\n杨柳：依依惜别的深情\n长亭：依依惜别的深情\n南浦：水路送别\n酒：排解愁绪之外，还饱含着深深的祝福\n2.思乡类\n月亮，鸿雁，莼羹鲈烩，捣衣，双鲤\n3.愁苦类\n梧桐，芭蕉，流水，猿猴，杜鹃，斜阳，夕阳，乌鸦\n4.抒怀类\n菊花：赞赏它坚强的品格 清高的气质\n梅花 ：傲雪坚强 不屈不挠的品格\n松柏：坚贞不屈的人格\n竹：坚定顽强 不屈不挠 蒸蒸日上\n黍离；对国家的昔盛今衰的痛心的伤感之情\n冰雪：心志的忠贞 品格的高尚\n草木：盛衰兴亡的感慨\n蝉：古人以为蝉风餐饮露高洁的象征，常以蝉的高洁表现自己品行的高洁\n5.爱情类\n红豆，莲，连理枝，比翼鸟：\n6.战争类\n长城，投笔，楼兰，柳营，请缨，羌笛7.闲适类\n五柳，东篱，三径：隐士",
            "人物类型\n友人、恋人、旅人、隐士、寒士、忠士、战士、迁客、举子、思妇等\n形象特征\n不慕权贵、豪放酒脱、傲岸不羁、心忧天下、忧国忧民、寄情山水、归隐田园、怀才不遇、壮志难酬、矢志报国、慷慨愤世、友人送别、思念故乡、寂寞孤独、献身边塞、反对征伐、爱恨情长、建功立业、悯农怜农、热爱山川、哀叹盛衰等",
            "1.明确拟人手法。\n描写事物形象的诗歌，往往把物当作人来写，从分析拟人手法入手会更容易理解诗歌的主旨。\n2.明确托物言志(象征)的手法。\n逐句概括所托之物的特征，留意是否使用了对比手法，以明确诗人所言之志。\n答题模板\n(1)概括意象特点:形象特点+情感寄托。\n(2)分析意象作用:象征义+手法+人格化形象+情感。xx事物具....的特点，象征着...的品质,渲染....的氛围，寄寓了诗....的感情。",
            "1.诗中赏画一看形，色 对、静，欣赏诗的画面头。古代许多写最诗多具有“诗中有画”的特征。欢育诗的画面美，主要从四方面着手:一是物象的组合方式，二是画面色彩;三是动态;四是静态。\n2.西中品诗由冷、现、明、暗的色调，把握诗人的情感思想。般而言， 作品所描绘的外在形象画面，具有鲜活 .明丽和品扬向上色调的，其内在形象情感则是高品乐观的:反之，外在形象画面具有阴暗.凄冷和低沉色调的，其内在形象情感则是低沉伤感的。\n3.借助意象品意境。意境是作者主观情感与自然客观物象融合的整体。江月去人只数尺，风灯照夜欲三更。沙头宿鹭联拳静，船尾跳鱼拨刺鸣。江月、风灯、宿鹭、跳鱼等意象有机地组合成清幽、静谧的意境。\n4.借助意象品情感。一曲新词酒一杯。去年天气旧亭台。夕阳西下几时回?无可奈何花落去，似曾相识燕归来。小园香径独徘徊。由坠落的夕阳、无声的落花、寻旧巢的归燕几个意象，可体会到全词的感情基调是抒写对人事变迁的无比惆怅之意。\n5.关注景物描写的角度。除动静外，还有声色、虚实、点面、远近、俯仰等。由此入手明确所写景物的特点,理解意境或情感。\n答题模板\n(1)概括意象特点:形象特点+情感寄托。\n(2)分析意象作用:象征义+手法+人格化形象+情感。xx景物具....的特点，象征...的品质，渲染....的氛围，寄寓了诗人...的感情。1.诗中赏画一看形，色 对、静，欣赏诗的画面头。古代许多写最诗多具有“诗中有画”的特征。欢育诗的画面美，主要从四方面着手:一是物象的组合方式，二是画面色彩;三是动态;四是静态。\n2.西中品诗由冷、现、明、暗的色调，把握诗人的情感思想。般而言， 作品所描绘的外在形象画面，具有鲜活 .明丽和品扬向上色调的，其内在形象情感则是高品乐观的:反之，外在形象画面具有阴暗.凄冷和低沉色调的，其内在形象情感则是低沉伤感的。\n3.借助意象品意境。意境是作者主观情感与自然客观物象融合的整体。江月去人只数尺，风灯照夜欲三更。沙头宿鹭联拳静，船尾跳鱼拨刺鸣。江月、风灯、宿鹭、跳鱼等意象有机地组合成清幽、静谧的意境。\n4.借助意象品情感。一曲新词酒一杯。去年天气旧亭台。夕阳西下几时回?无可奈何花落去，似曾相识燕归来。小园香径独徘徊。由坠落的夕阳、无声的落花、寻旧巢的归燕几个意象，可体会到全词的感情基调是抒写对人事变迁的无比惆怅之意。\n5.关注景物描写的角度。除动静外，还有声色、虚实、点面、远近、俯仰等。由此入手明确所写景物的特点,理解意境或情感。\n答题模板\n(1)概括意象特点:形象特点+情感寄托。\n(2)分析意象作用:象征义+手法+人格化形象+情感。xx景物具....的特点，象征...的品质，渲染....的氛围，寄寓了诗人...的感情。",
    };

    public static String[] community_title={"学会这些，高考地理不用愁！",
            "考生参考：高考作文获得高分的五字要诀",
            "数学公式漏记?不用怕，我来帮你",
            "高考英语单词容易出错?记住这些就够了",
    };
    public static String[] community_content={"1、描述类——多为看图归纳\n" +
            "　　（1）、某地理事物的走向（如山脉、河流、等值线等等）\n" +
            "　　（2）、自然特征的描述（如气候、地形、水文、植被、土壤、地质状况）\n" +
            "　　（3）、人文特征的描述（如农业、工业、交通、城市、人口、旅游、环境状况）\n" +
            "　　（4）、某地理事物的分布特征（气候的分布、农作物的分布、人口分布、植被分布等）\n" +
            "　　（5）、某地理事物发展变化过程的描述（如盐碱化过程、天气变化、风向变化等）\n" +
            "　　（6）、多个地理事物之间关系的描述\n" +
            "2、原因分析类\n" +
            "　　自然原因一般从地形.地势.气候.水文(河流.湖泊).植被.土壤.矿产.洋流.纬度位置.海陆位置.海陆轮廓.板块运动等来分析;人为原因一般从历史条件.人类各种活动.交通.工程建设.市场.政策.科技.军事(战争).宗教等方面分析.分析时应该抓住主要原因.常见的有以下：\n" +
            "　　逆温、温度变化原因、温差大小、光照强弱、降水、气压、天气、气候、温室效应、臭氧层破坏、酸雨、盐度、洋流、渔场、赤潮、地震、滑坡、泥石流、沙尘暴、水能、水土流失、荒漠化、盐碱化、地貌成因、地质构造、河流水文变化、旱涝、岩石成因、缺水原因、人口分布、人口增长、人口迁移、逆城市化\n" +
            "3、区位因素（区位条件）评析类（或者布局是否合理）\n" +
            "　　回答此类问题一要从有利和不利两方面来阐述;二要从对自然.社会.经济的发展三方面综合分析判断得出结论.主要涉及人文地理事物的布局因素：农业、工业、城市、交通线（点）、商业中心等。分析的时候注意有利和不利的。\n" +
            "4、开发与环保类\n" +
            "　　一般要先答出某地区的资源状况，再答出开发这种资源的时候要注意什么样的环境问题。\n" +
            "5、危害、措施及治理类\n" +
            "　　如能源措施、某工业区的整治、某环境问题的措施、某大河流的治理\n" +
            "6、意义类\n" +
            "　　一般包括经济意义、社会意义、环境意义\n" +
            "7、画图类\n" +
            "　　多为画地形剖面图\n" +
            "8、特征问题\n" +
            "　　（1）地形(地貌)特征主要从地形种类(高原.山地.丘陵.平原.盆地.山谷或河谷.冲积扇.三角洲),地面起伏状况(坡度陡缓.相对高差),海拔高度等方面概括.\n" +
            "　　（2）地表环境特征主要从气候(湿.热.冷.干),植被状况,土地类型(荒漠.草地.林地.耕地),河流发育程度等方面概括.\n" +
            "　　（3）气候特征主要从气温(高低的季节变化.年较差),降水(年降水量的多少.季节变化),四季的变化(冬夏季节的长短)等方面概括.\n" +
            "　　（4）.河流水文特征主要从流量的大小.水位的变化(汛期与枯水期).含沙量的多少.结冰期.河流落差.河床的宽窄.河水流速的快慢.河流长短.支流的多少及分布等方面概括.\n" +
            "　　（5）.农业生产特征主要从农业地域类型.农作物种类和单位面积产量.农业各部门结构(所占比重).农业机械化水平.农业生产经营方式和专门化水平等方面概括.\n" +
            "　　（6）.工业生产特征主要从工业的发达程度.工业部门结构.工业技术水平.工业产品的销售和工业原料能源对国际市场的依赖程度等方面概括.\n" +
            "　　（7）.农业.工业.城市.旅游等区位特征要从自然和社会两方面分析.\n" +
            "　　农业区位：自然因素：气候、水源、土壤、地形；社会经济因素：市场需求、交通运输、劳动力、工业和城市的发展、科技、政策\n" +
            "　　工业区位：自然因素:地形.水源等；经济因素：资源、市场、劳动力、交通、科技、政策；社会因素：个人偏好、工业惯性、国防、就业、平衡性别比例等；环境因素：大气污染、水污染、固体废弃物污染、噪声污染等。\n" +
            "　　城市区位：自然因素：气候、地形、河流（湖泊）；社会经济因素：自然资源、交通、政治、军事、宗教、科教、旅游\n" +
            "　　旅游（影响旅游资源开发）区位：旅游资源的游览价值；市场距离；交通位置及通达性；地区接待能力；环境承载量\n" +
            "　　（8）地理事物的分布特征主要从空间分布（是否均匀、空间变化规律）和时间分配（季节和年际变化的大小）两方面概括。\n" +
            "　　（9）如何分析一个地区（省）或者一个城市经济发展区位条件：\n" +
            "　　地理位置优越；自然条件（分析气候、地形、土壤、水源）优越；工农业基础条件（好）；资源条件（丰富）；劳动力条件（人口众多，劳动力丰富）；交通条件（便利）；市场条件（广阔）；吸引外资和对外贸易额（比例多）；国家政策和开放程度；旅游条件（丰富，地域组合好）；其他条件（国家大型工程等）。\n" +
            "　　（10）如何改善一个城市的交通条件：\n" +
            "　　建四通八达的立体交通网络；加强城市道路的规划和建设；扩宽道路，专线（定线）行使；建立统一的交通指挥系统；统一培训驾驶员；减少过境车辆进入城市。\n" +
            "　　（11）如何改善一个城市的环境：\n" +
            "　　加强城市的规划和管理；搞好环境教育，提高公众意思，加强环境管理；改善能源消费结构；加强绿化；对垃圾进行无害、再生处理。\n" +
            "　　（12）如何发展农村经济：（普通）\n" +
            "　　控制人口数量，提高人口素质；加大绿化，改善生态环境；有计划的退耕还林还草；调整农村产业结构，发展多种经营；加大科技投入，发展农产品加工、商品农业，提高农民收入。\n" +
            "　　（13）山区农业资源如何综合开发：（以江南丘陵为例）\n" +
            "　　走立体农业的道路；优势资源的系列开发；植树造林，保持水土；解决农村能源问题；改良红壤；搞好水利工程建设，提高防洪抗灾能力。\n" +
            "　　（14）如何综合整治（发展）一个工业区（鲁尔区、辽中南等）的经济：\n" +
            "　　发展新兴工业和第三产业，改造传统产业，促进经济结构多样化；调整工业布局，保证各行业平衡发展；发展交通，完善交通网；发展科技，提高人口素质，繁荣经济；消除污染，整治环境，美化环境；搞好区域规划，加强生态建设；因地制宜的合理利用和开发各类资源。\n" +
            "　　（15）．如何分析生态农业——新型农业的优势：\n" +
            "　　充分利用了自然条件，挖掘了生产潜力；调整了产业结构；发展了经济，增加了农民收入；保护和改善了生态环境；提高了综合利用。\n" +
            "　　（16）．分析一个地区（省）的资源优势：\n" +
            "　　土地资源——面积大小，土壤的类型、土壤肥脊，可开垦土地等；\n" +
            "　　气候资源——气候类型，气温，降水，光照；\n" +
            "　　矿产资源——煤炭，石油，天然气，铁矿，铝土矿，磷，硫等；\n" +
            "　　生物资源——农业基地，经济作物基地，林业基地，水果基地，特色农业等；\n" +
            "　　水资源——降水多少，河流，地下水，高山冰雪溶水等。\n" +
            "　　（17）、我国中部崛起的区位条件：\n" +
            "　　中部地区气候湿润，雨量充沛，名山大川多，江、河、湖、库星罗棋布，动植物资源丰富；中部地区水资源量、水库容量、耕地面积、煤炭、有色金属等资源优势突出，是我国重要的能源和原材料基地；中部是我国最大的商品粮基地，保证我国的粮食安全；中部具有承接东西、贯通南北的区位；交通便利，长江黄金水道、多条铁路干线及国道公路从中部通过；中部地区还具有丰富的人力资源。\n" +
            "　　山西省成为国家重点能源基地的区位优势：\n" +
            "　　煤炭储量丰富；有多条运煤干线与海港连通，利于能源输出；接近东部沿海的能源消费地区。\n" +
            "　　山西省如何将资源优势转变为经济优势：\n" +
            "　　摸清资源的储量，加强资源开发利用的规划；依靠科技，强化资源加工环节，提高资源的附加值；加强资源的综合利用，减少污染，美化环境；在煤炭资源的基础上，大力发展煤化学工业、电力工业；调整产业结构，加大发展新兴产业和第三产业等。\n" +
            "　　（18）首都由沿海迁往内陆的主要原因分析：\n" +
            "　　加强对广大内地的管理；促进内地的开发和经济发展；分散大城市职能；有利于国防安全。\n",

            "高考作文时间短，阅卷迅速，有着许多特殊性，考生要注意特别对待，以避免不必要的失分。作文要得高分，可以从以下五个字上面下点功夫：\n" +
                    "\n" +
                    "　　⒈显\n" +
                    "　　由于时间关系，高考阅卷老师不能细细揣摩文章，也不能明晓考生的作文功底，考生要特别讲究一个“显”字。\n" +
                    "\n" +
                    "　　首先，文章的主旨要明了，平时作文，有学生喜欢写些含蓄的文字，以求文学的含蓄美，也得到了老师的青睐，甚至发表了不少的文章，但是高考场上不能这样做，太含蓄了，就会使文章走进隐讳的死胡同，短时间内难以让人读懂，就很容易被阅卷老师误认为离题打入冷宫。\n" +
                    "\n" +
                    "　　其次，文章的分论点最好用分段的方式明确摆出，开头、中间、结尾都要顾及体现自己中心思想的语句，最明显的方法就是把它们放在段首，好让阅卷者一目了然。例如，2003年高考福建满分作文《用旁观的眼神》全文用了七个段落，中间段落首句有这样明显的观点句：“用旁观的眼神看别人，是意识的清醒。”“用旁观的眼神看事物，是理念的超越。”还有一个段落这样集中写道：“用旁观的眼神，才有了顾况毫无私心，发出的“居，即易也”的真诚赞赏，让初露才华的白居易消除了后顾之忧；用旁观的眼神，才有了徐悲鸿力携傅抱石，大力支持他出国深造，成就了一代名家的事业；旁观的眼神，才有了毕加索与张大千化倾心交谈，奏一曲东西方绘画相融相成的绝唱!”你说，这样明朗，这样有观点的文章让人看了不舒心吗？\n" +
                    "\n" +
                    "　　另外，还要注意把你认为写得最得意的语句放在段首，或者用题记的方式醒目标示，或者干脆另立段落。\n" +
                    "\n" +
                    "　　⒉虚\n" +
                    "　　虚就是虚构。高考作文能写实固然好，但由于我们长期处在学校——家庭两点一线的生活方式，很难发现生活中真实动人的故事。高考作文要求有创新，必然把原本平淡无奇的事情编得生动曲折。例如，2003年高考湖南满分作文《保姆与家教》就用小小说的形式，虚构了一个故事。作者从一个社会学教授的心理感受出发，把她置身于一场裙子风波中，真切地显露了她对勤劳实在的保姆信任，对热情活泼的家教猜疑，而风波的结果却出乎她的意料，从而生动地嘲讽了那些凭感情亲疏来认知事物的错误倾向。当然，虚构要符合生活的真实，《保姆与家教》中的保姆是乡下妹子，貌似朴实，家教是大三学生，喜爱漂亮，不要说教授，就是我们常人都要怀疑家教偷穿了裙子，何况，保姆做事井井有条，家教教学聊得正欢呢？不过，值得注意的是，虚构不能没了生活的基础，1999年高考作文题为《坚韧——我追求的品格》《战胜脆弱》，当年就有很多学生为了夺得阅卷老师的动人目光，虚构了“父母双亡”的故事，也丧失了做人的道德，1999年也曾被阅卷老师戏称为“父母双亡年”，这就失去了虚构的道德准则。\n" +
                    "\n" +
                    "　　⒊全\n" +
                    "　　全即文章的结合呼应，给人完整感。阅卷人的心理，对文章的开头、中间、结尾很看重，特别是结尾的结构呼应或者主题升华的语言等等。例如，2002年高考陕西满分作文《红舞鞋》，文章有机地安排了这样两条线索：①“我”带着往日的荣耀，高傲地参加了征文比赛，结果失败了；②珈伦穿上美丽的红舞鞋，忘情地舞着，以至于鞋已经长到脚上了，只好请求砍去双脚。文章构思的精妙之处在于，巧妙地把这两条线索并行推进，明暗交错，故事的内涵也不言自明，形成一种错落有致而又完整的意境美。结尾处用“是啊，荣誉已是往事，我又何苦被它束缚？与不实际的“红舞鞋”说GOODBYE吧！成功在向你招手！”道出了在往事与现实面前的合理选择，扣住了话题，从而也把两条线索完整地收在了一起了。文章得满分也就理所当然。\n" +
                    "\n" +
                    "　　⒋简\n" +
                    "　　简即简笔勾勒。高考的一般议论文也好，一般记叙文也好，最好需要多种材料的荟萃，这样信息量大，以符合“内容充实”的要求，因而不欢迎一些时间、地点、人物、发生、发展、高潮、结局俱在的材料啰嗦记叙。一般记叙文，特别有点散文形式的作文，特别忌讳一人一事的简单记叙（当然构思精巧的小小说除外），以免使文章走入浅薄的深渊。例如，2002年高考上海一篇满分作文《面对大海》中有这样精彩的一段：海与大河不同。河流缓缓流淌，如老聃的“清静微妙，守玄抱一”；而大海变化万千，如庄周的“洞达而放逸”。海水的磅礴之势，海水的傲视天下，海水的宁静微澜——面对这样的海，我听到的是孟德的“烈士暮年，壮心不已”；我看到的是太白的“孤帆一片日边来”；我想到的是子寿的“海上生明月，天涯共此时”。这样一段精彩的文字就来源于对材料的精心锤炼，文字洗练而内蕴丰富，何乐而不为？至于议论文材料语言的简洁更是众所周知的特点。考场上故事写得概括些，一可以增加故事的容量，从多角度阐明话题观点，二可以更加使段落层次明了，形成简洁明快的美点。\n" +
                    "\n" +
                    "　　⒌亮\n" +
                    "　　亮就是试卷上的亮点。亮点是多方面的，字迹端正、卷面整洁是其中第一要着。文章无错别字，没有明显的病句，没有明显的涂改痕迹，行款漂亮等等，都会让阅卷老师一翻到试卷就精神大振，产生好感，不忍心打低分。每年高考评卷场上，卷面上一字不改的作文有很多都是高分作文。作文有文采，这是使作文亮起来的又一要着。文采的讲究也是多方面的，排比句、对偶句、长短句的灵活运用都很见作者功力，阅卷老师最喜爱阅读，这往往又使作文亮出色彩而获高分。\n" +
                    "\n" +
                    "　　高考作文与平时作文是不能完全等同的，但只要注意一些考场技巧，在平时训练中多多落实，还是会显示出自己应有的风采的。\n",

            "常用的诱导公式有以下几组：\n" +
                    "\n" +
                    "　　公式一：\n" +
                    "　　设α为任意角，终边相同的角的同一三角函数的值相等：\n" +
                    "　　sin（2kπ＋α）＝sinα （k∈Z）\n" +
                    "　　cos（2kπ＋α）＝cosα （k∈Z）\n" +
                    "　　tan（2kπ＋α）＝tanα （k∈Z）\n" +
                    "　　cot（2kπ＋α）＝cotα （k∈Z）\n" +
                    "\n" +
                    "　　公式二：\n" +
                    "　　设α为任意角，π+α的三角函数值与α的三角函数值之间的关系：\n" +
                    "　　sin（π＋α）＝－sinα\n" +
                    "　　cos（π＋α）＝－cosα\n" +
                    "　　tan（π＋α）＝tanα\n" +
                    "　　cot（π＋α）＝cotα\n" +
                    "\n" +
                    "　　公式三：\n" +
                    "　　任意角α与 -α的三角函数值之间的关系：\n" +
                    "　　sin（－α）＝－sinα\n" +
                    "　　cos（－α）＝cosα\n" +
                    "　　tan（－α）＝－tanα\n" +
                    "　　cot（－α）＝－cotα\n" +
                    "\n" +
                    "　　公式四：\n" +
                    "　　利用公式二和公式三可以得到π-α与α的三角函数值之间的关系：\n" +
                    "　　sin（π－α）＝sinα\n" +
                    "　　cos（π－α）＝－cosα\n" +
                    "　　tan（π－α）＝－tanα\n" +
                    "　　cot（π－α）＝－cotα\n" +
                    "\n" +
                    "　　公式五：\n" +
                    "　　利用公式一和公式三可以得到2π-α与α的三角函数值之间的关系：\n" +
                    "　　sin（2π－α）＝－sinα\n" +
                    "　　cos（2π－α）＝cosα\n" +
                    "　　tan（2π－α）＝－tanα\n" +
                    "　　cot（2π－α）＝－cotα\n" +
                    "\n" +
                    "　　公式六：\n" +
                    "　　π/2±α及3π/2±α与α的三角函数值之间的关系：\n" +
                    "　　sin（π/2＋α）＝cosα\n" +
                    "　　cos（π/2＋α）＝－sinα\n" +
                    "　　tan（π/2＋α）＝－cotα\n" +
                    "　　cot（π/2＋α）＝－tanα\n" +
                    "　　sin（π/2－α）＝cosα\n" +
                    "　　cos（π/2－α）＝sinα\n" +
                    "　　tan（π/2－α）＝cotα\n" +
                    "　　cot（π/2－α）＝tanα\n" +
                    "　　sin（3π/2＋α）＝－cosα\n" +
                    "　　cos（3π/2＋α）＝sinα\n" +
                    "　　tan（3π/2＋α）＝－cotα\n" +
                    "　　cot（3π/2＋α）＝－tanα\n" +
                    "　　sin（3π/2－α）＝－cosα\n" +
                    "　　cos（3π/2－α）＝－sinα\n" +
                    "　　tan（3π/2－α）＝cotα\n" +
                    "　　cot（3π/2－α）＝tanα\n" +
                    "\n" +
                    "　　(以上k∈Z)\n" +
                    "　　注意：在做题时，将a看成锐角来做会比较好做。\n" +
                    "\n" +
                    "　　诱导公式记忆口诀\n" +
                    "\n" +
                    "　　※规律总结※\n" +
                    "\n" +
                    "　　上面这些诱导公式可以概括为：\n" +
                    "\n" +
                    "　　对于π/2*k ±α(k∈Z)的三角函数值，\n" +
                    "\n" +
                    "　　①当k是偶数时，得到α的同名函数值，即函数名不改变；\n" +
                    "\n" +
                    "　　②当k是奇数时，得到α相应的余函数值，即sin→cos；cos→sin；tan→cot，cot→tan.\n" +
                    "\n" +
                    "　　（奇变偶不变）\n" +
                    "\n" +
                    "　　然后在前面加上把α看成锐角时原函数值的符号。\n" +
                    "\n" +
                    "　　（符号看象限）\n" +
                    "\n" +
                    "　　例如：\n" +
                    "\n" +
                    "　　sin(2π－α)＝sin(4·π/2－α)，k＝4为偶数，所以取sinα。\n" +
                    "\n" +
                    "　　当α是锐角时，2π－α∈(270°，360°)，sin(2π－α)＜0，符号为“－”。\n" +
                    "\n" +
                    "　　所以sin(2π－α)＝－sinα\n" +
                    "\n" +
                    "　　上述的记忆口诀是：\n" +
                    "\n" +
                    "　　奇变偶不变，符号看象限。\n" +
                    "\n" +
                    "　　公式右边的符号为把α视为锐角时，角k·360°+α（k∈Z），-α、180°±α，360°-α\n" +
                    "\n" +
                    "　　所在象限的原三角函数值的符号可记忆\n" +
                    "\n" +
                    "　　水平诱导名不变；符号看象限。\n" +
                    "\n" +
                    "　　＃\n" +
                    "\n" +
                    "　　各种三角函数在四个象限的符号如何判断，也可以记住口诀“一全正；二正弦(余割)；三两切；四余弦(正割)”．\n" +
                    "\n" +
                    "　　这十二字口诀的意思就是说：\n" +
                    "\n" +
                    "　　第一象限内任何一个角的四种三角函数值都是“＋”；\n" +
                    "\n" +
                    "　　第二象限内只有正弦是“＋”，其余全部是“－”；\n" +
                    "\n" +
                    "　　第三象限内切函数是“＋”，弦函数是“－”；\n" +
                    "\n" +
                    "　　第四象限内只有余弦是“＋”，其余全部是“－”．\n" +
                    "\n" +
                    "　　上述记忆口诀，一全正，二正弦，三内切，四余弦\n" +
                    "\n" +
                    "　　＃\n" +
                    "\n" +
                    "　　还有一种按照函数类型分象限定正负：\n" +
                    "\n" +
                    "　　函数类型 第一象限 第二象限 第三象限 第四象限\n" +
                    "\n" +
                    "　　正弦 ...........＋............＋............—............—........\n" +
                    "\n" +
                    "　　余弦 ...........＋............—............—............＋........\n" +
                    "\n" +
                    "　　正切 ...........＋............—............＋............—........\n" +
                    "\n" +
                    "　　余切 ...........＋............—............＋............—........\n" +
                    "\n" +
                    "　　同角三角函数基本关系\n" +
                    "\n" +
                    "　　同角三角函数的基本关系式\n" +
                    "\n" +
                    "　　倒数关系：\n" +
                    "\n" +
                    "　　tanα·cotα＝1\n" +
                    "\n" +
                    "　　sinα·cscα＝1\n" +
                    "\n" +
                    "　　cosα·secα＝1\n" +
                    "\n" +
                    "　　商的关系：\n" +
                    "\n" +
                    "　　sinα/cosα＝tanα＝secα/cscα\n" +
                    "\n" +
                    "　　cosα/sinα＝cotα＝cscα/secα\n" +
                    "\n" +
                    "　　平方关系：\n" +
                    "\n" +
                    "　　sin^2(α)＋cos^2(α)＝1\n" +
                    "\n" +
                    "　　1＋tan^2(α)＝sec^2(α)\n" +
                    "\n" +
                    "　　1＋cot^2(α)＝csc^2(α)\n" +
                    "\n" +
                    "　　同角三角函数关系六角形记忆法\n" +
                    "\n" +
                    "　　六角形记忆法：（参看图片或参考资料链接）\n" +
                    "\n" +
                    "　　构造以\"上弦、中切、下割；左正、右余、中间1\"的正六边形为模型。\n" +
                    "\n" +
                    "　　（1）倒数关系：对角线上两个函数互为倒数；\n" +
                    "\n" +
                    "　　（2）商数关系：六边形任意一顶点上的函数值等于与它相邻的两个顶点上函数值的乘积。\n" +
                    "\n" +
                    "　　（主要是两条虚线两端的三角函数值的乘积）。由此，可得商数关系式。\n" +
                    "\n" +
                    "　　（3）平方关系：在带有阴影线的三角形中，上面两个顶点上的三角函数值的平方和等于下面顶点上的三角函数值的平方。\n" +
                    "\n" +
                    "　　两角和差公式\n" +
                    "\n" +
                    "　　两角和与差的三角函数公式\n" +
                    "\n" +
                    "　　sin（α＋β）＝sinαcosβ＋cosαsinβ\n" +
                    "\n" +
                    "　　sin（α－β）＝sinαcosβ－cosαsinβ\n" +
                    "\n" +
                    "　　cos（α＋β）＝cosαcosβ－sinαsinβ\n" +
                    "\n" +
                    "　　cos（α－β）＝cosαcosβ＋sinαsinβ\n" +
                    "\n" +
                    "　　tan（α＋β）＝(tanα+tanβ)／(1-tanαtanβ)\n" +
                    "\n" +
                    "　　tan（α－β）＝(tanα－tanβ)／(1＋tanα·tanβ)\n" +
                    "\n" +
                    "　　二倍角公式\n" +
                    "\n" +
                    "　　二倍角的正弦、余弦和正切公式（升幂缩角公式）\n" +
                    "\n" +
                    "　　sin2α＝2sinαcosα\n" +
                    "\n" +
                    "　　cos2α＝cos^2(α)－sin^2(α)＝2cos^2(α)－1＝1－2sin^2(α)\n" +
                    "\n" +
                    "　　tan2α＝2tanα/[1－tan^2(α)]\n" +
                    "\n" +
                    "　　半角公式\n" +
                    "\n" +
                    "　　半角的正弦、余弦和正切公式（降幂扩角公式）\n" +
                    "\n" +
                    "　　sin^2(α/2)＝(1－cosα)／2\n" +
                    "\n" +
                    "　　cos^2(α/2)＝(1＋cosα)／2\n" +
                    "\n" +
                    "　　tan^2(α/2)＝(1－cosα)／(1＋cosα)\n" +
                    "\n" +
                    "　　另也有tan(α/2)=(1－cosα)/sinα=sinα/(1+cosα)\n" +
                    "\n" +
                    "　　万能公式\n" +
                    "\n" +
                    "　　sinα=2tan(α/2)/[1+tan^2(α/2)]\n" +
                    "\n" +
                    "　　cosα=[1-tan^2(α/2)]/[1+tan^2(α/2)]\n" +
                    "\n" +
                    "　　tanα=2tan(α/2)/[1-tan^2(α/2)]\n" +
                    "\n" +
                    "　　万能公式推导\n" +
                    "\n" +
                    "　　附推导：\n" +
                    "\n" +
                    "　　sin2α=2sinαcosα=2sinαcosα/(cos^2(α)+sin^2(α))......*，\n" +
                    "\n" +
                    "　　（因为cos^2(α)+sin^2(α)=1）\n" +
                    "\n" +
                    "　　再把*分式上下同除cos^2(α)，可得sin2α＝2tanα/(1＋tan^2(α))\n" +
                    "\n" +
                    "　　然后用α/2代替α即可。\n" +
                    "\n" +
                    "　　同理可推导余弦的万能公式。正切的万能公式可通过正弦比余弦得到。\n" +
                    "\n" +
                    "　　三倍角公式\n" +
                    "\n" +
                    "　　三倍角的正弦、余弦和正切公式\n" +
                    "\n" +
                    "　　sin3α＝3sinα－4sin^3(α)\n" +
                    "\n" +
                    "　　cos3α＝4cos^3(α)－3cosα\n" +
                    "\n" +
                    "　　tan3α＝[3tanα－tan^3(α)]／[1－3tan^2(α)]\n" +
                    "\n" +
                    "　　三倍角公式推导\n" +
                    "\n" +
                    "　　附推导：\n" +
                    "\n" +
                    "　　tan3α＝sin3α/cos3α\n" +
                    "\n" +
                    "　　＝(sin2αcosα＋cos2αsinα)/(cos2αcosα-sin2αsinα)\n" +
                    "\n" +
                    "　　＝(2sinαcos^2(α)＋cos^2(α)sinα－sin^3(α))/(cos^3(α)－cosαsin^2(α)－2sin^2(α)cosα)\n" +
                    "\n" +
                    "　　上下同除以cos^3(α)，得：\n" +
                    "\n" +
                    "　　tan3α＝(3tanα－tan^3(α))/(1-3tan^2(α))\n" +
                    "\n" +
                    "　　sin3α＝sin(2α＋α)＝sin2αcosα＋cos2αsinα\n" +
                    "\n" +
                    "　　＝2sinαcos^2(α)＋(1－2sin^2(α))sinα\n" +
                    "\n" +
                    "　　＝2sinα－2sin^3(α)＋sinα－2sin^3(α)\n" +
                    "\n" +
                    "　　＝3sinα－4sin^3(α)\n" +
                    "\n" +
                    "　　cos3α＝cos(2α＋α)＝cos2αcosα－sin2αsinα\n" +
                    "\n" +
                    "　　＝(2cos^2(α)－1)cosα－2cosαsin^2(α)\n" +
                    "\n" +
                    "　　＝2cos^3(α)－cosα＋(2cosα－2cos^3(α))\n" +
                    "\n" +
                    "　　＝4cos^3(α)－3cosα\n" +
                    "\n" +
                    "　　即\n" +
                    "\n" +
                    "　　sin3α＝3sinα－4sin^3(α)\n" +
                    "\n" +
                    "　　cos3α＝4cos^3(α)－3cosα\n" +
                    "\n" +
                    "　　三倍角公式联想记忆\n" +
                    "\n" +
                    "　　★记忆方法：谐音、联想\n" +
                    "\n" +
                    "　　正弦三倍角：3元 减 4元3角（欠债了(被减成负数)，所以要“挣钱”(音似“正弦”)）\n" +
                    "\n" +
                    "　　余弦三倍角：4元3角 减 3元（减完之后还有“余”）\n" +
                    "\n" +
                    "　　☆☆注意函数名，即正弦的三倍角都用正弦表示，余弦的三倍角都用余弦表示。\n" +
                    "\n" +
                    "　　★另外的记忆方法：\n" +
                    "\n" +
                    "　　正弦三倍角： 山无司令 (谐音为 三无四立) 三指的是\"3倍\"sinα， 无指的是减号， 四指的是\"4倍\"， 立指的是sinα立方\n" +
                    "\n" +
                    "　　余弦三倍角： 司令无山 与上同理\n" +
                    "\n" +
                    "　　和差化积公式\n" +
                    "\n" +
                    "　　三角函数的和差化积公式\n" +
                    "\n" +
                    "　　sinα＋sinβ＝2sin[(α＋β)/2]·cos[(α－β)/2]\n" +
                    "\n" +
                    "　　sinα－sinβ＝2cos[(α＋β)/2]·sin[(α－β)/2]\n" +
                    "\n" +
                    "　　cosα＋cosβ＝2cos[(α＋β)/2]·cos[(α－β)/2]\n" +
                    "\n" +
                    "　　cosα－cosβ＝－2sin[(α＋β)/2]·sin[(α－β)/2]\n" +
                    "\n" +
                    "　　积化和差公式\n" +
                    "\n" +
                    "　　三角函数的积化和差公式\n" +
                    "\n" +
                    "　　sinα·cosβ＝0.5[sin(α＋β)＋sin(α－β)]\n" +
                    "\n" +
                    "　　cosα·sinβ＝0.5[sin(α＋β)－sin(α－β)]\n" +
                    "\n" +
                    "　　cosα·cosβ＝0.5[cos(α＋β)＋cos(α－β)]\n" +
                    "\n" +
                    "　　sinα·sinβ＝－0.5[cos(α＋β)－cos(α－β)]\n" +
                    "\n" +
                    "　　和差化积公式推导\n" +
                    "\n" +
                    "　　附推导：\n" +
                    "\n" +
                    "　　首先，我们知道sin(a+b)=sina*cosb+cosa*sinb，sin(a-b)=sina*cosb-cosa*sinb\n" +
                    "\n" +
                    "　　我们把两式相加就得到sin(a+b)+sin(a-b)=2sina*cosb\n" +
                    "\n" +
                    "　　所以，sina*cosb=(sin(a+b)+sin(a-b))/2\n" +
                    "\n" +
                    "　　同理，若把两式相减，就得到cosa*sinb=(sin(a+b)-sin(a-b))/2\n" +
                    "\n" +
                    "　　同样的，我们还知道cos(a+b)=cosa*cosb-sina*sinb，cos(a-b)=cosa*cosb+sina*sinb\n" +
                    "\n" +
                    "　　所以，把两式相加，我们就可以得到cos(a+b)+cos(a-b)=2cosa*cosb\n" +
                    "\n" +
                    "　　所以我们就得到，cosa*cosb=(cos(a+b)+cos(a-b))/2\n" +
                    "\n" +
                    "　　同理，两式相减我们就得到sina*sinb=-(cos(a+b)-cos(a-b))/2\n" +
                    "\n" +
                    "　　这样，我们就得到了积化和差的四个公式：\n" +
                    "\n" +
                    "　　sina*cosb=(sin(a+b)+sin(a-b))/2\n" +
                    "\n" +
                    "　　cosa*sinb=(sin(a+b)-sin(a-b))/2\n" +
                    "\n" +
                    "　　cosa*cosb=(cos(a+b)+cos(a-b))/2\n" +
                    "\n" +
                    "　　sina*sinb=-(cos(a+b)-cos(a-b))/2\n" +
                    "\n" +
                    "　　有了积化和差的四个公式以后，我们只需一个变形，就可以得到和差化积的四个公式。\n" +
                    "\n" +
                    "　　我们把上述四个公式中的a+b设为x，a-b设为y，那么a=(x+y)/2，b=(x-y)/2\n" +
                    "\n" +
                    "　　把a，b分别用x，y表示就可以得到和差化积的四个公式：\n" +
                    "\n" +
                    "　　sinx+siny=2sin((x+y)/2)*cos((x-y)/2)\n" +
                    "\n" +
                    "　　sinx-siny=2cos((x+y)/2)*sin((x-y)/2)\n" +
                    "\n" +
                    "　　cosx+cosy=2cos((x+y)/2)*cos((x-y)/2)\n" +
                    "\n" +
                    "　　cosx-cosy=-2sin((x+y)/2)*sin((x-y)/2)\n",

            "根据历年高考英语试卷整理出了最容易让考生出错的36组英语单词，现收录如下，希望能对广大高考考生有所帮助：\n" +
                    "\n" +
                    "　　1) quite 相当；quiet 安静地\n" +
                    "\n" +
                    "　　2) affect v. 影响, 假装；effect n. 结果, 影响\n" +
                    "\n" +
                    "　　3) adapt 适应；adopt 采用；adept 内行\n" +
                    "\n" +
                    "　　4) angel 天使；angle 角度\n" +
                    "\n" +
                    "　　5) dairy 牛奶厂；diary 日记\n" +
                    "\n" +
                    "　　6) contend 奋斗, 斗争；content 内容, 满足的；context 上下文；contest 竞争, 比赛\n" +
                    "\n" +
                    "　　7) principal 校长, 主要的；principle 原则\n" +
                    "\n" +
                    "　　8) implicit 含蓄的；explicit 明白的\n" +
                    "\n" +
                    "　　9) dessert 甜食；desert 沙漠v 放弃；dissert 写论文\n" +
                    "\n" +
                    "　　10) pat 轻拍；tap 轻打；slap 掌击；rap 敲，打\n" +
                    "\n" +
                    "　　11) decent 正经的；descent n 向下, 血统；descend v 向下\n" +
                    "\n" +
                    "　　12) sweet 甜的；sweat 汗水\n" +
                    "\n" +
                    "　　13) later 后来；latter 后者；latest 最近的；lately adv 最近\n" +
                    "\n" +
                    "　　14) costume 服装；custom 习惯\n" +
                    "\n" +
                    "　　15) extensive 广泛的；intensive 深刻的\n" +
                    "\n" +
                    "　　16) aural 耳的；oral 口头的\n" +
                    "\n" +
                    "　　17) abroad 国外；aboard 上（船，飞机）\n" +
                    "\n" +
                    "　　18) altar 祭坛；alter 改变\n" +
                    "\n" +
                    "　　19) assent 同意；ascent 上升；accent 口\n" +
                    "\n" +
                    "　　20) champion 冠军；champagne 香槟酒；campaign 战役\n" +
                    "\n" +
                    "　　21) baron 男爵；barren 不毛之地的；barn 古仓\n" +
                    "\n" +
                    "　　22) beam 梁，光束；bean 豆；been be的过去式\n" +
                    "\n" +
                    "　　23) precede 领先；proceed 进行，继续\n" +
                    "\n" +
                    "　　24) pray 祈祷；prey 猎物\n" +
                    "\n" +
                    "　　25) chicken 鸡；kitchen 厨房\n" +
                    "\n" +
                    "　　26) monkey 猴子；donkey 驴\n" +
                    "\n" +
                    "　　27) chore 家务活；chord 和弦；cord 细绳\n" +
                    "\n" +
                    "　　28) cite 引用；site 场所；sight 视觉\n" +
                    "\n" +
                    "　　29) clash （金属）幢击声；crash 碰幢，坠落；crush 压\n" +
                    "\n" +
                    "　　30) compliment 赞美；complement 附加物\n" +
                    "\n" +
                    "　　31) confirm 确认；conform 使顺从\n" +
                    "\n" +
                    "　　32) contact 接触；contract 合同；contrast 对照\n" +
                    "\n" +
                    "　　33) council 议会；counsel 忠告；consul 领事\n" +
                    "\n" +
                    "　　34) crow 乌鸦；crown 王冠；clown 小丑；cow 牛\n" +
                    "\n" +
                    "　　35) dose 一剂药；doze 打盹\n" +
                    "\n" +
                    "　　36) drawn draw 的过去分词；drown 溺水\n",
    };

    public static String[] heatrate={"336已读","18已读","134已读","96已读"};
    public static String[] crriculum={};
}
