package com.edu.edusystem.fragment_study;

public class stu_data {
    public static String[] title={"诗歌类——意象",
            "诗歌类——人物形象",
            "诗歌类——事物形象",
            "诗歌类——景物形象",
    };
    public static String[] content={"1.送别类\n杨柳：依依惜别的深情\n长亭：依依惜别的深情\n南浦：水路送别\n酒：排解愁绪之外，还饱含着深深的祝福\n2.思乡类\n月亮，鸿雁，莼羹鲈烩，捣衣，双鲤\n3.愁苦类\n梧桐，芭蕉，流水，猿猴，杜鹃，斜阳，夕阳，乌鸦\n4.抒怀类\n菊花：赞赏它坚强的品格 清高的气质\n梅花 ：傲雪坚强 不屈不挠的品格\n松柏：坚贞不屈的人格\n竹：坚定顽强 不屈不挠 蒸蒸日上\n黍离；对国家的昔盛今衰的痛心的伤感之情\n冰雪：心志的忠贞 品格的高尚\n草木：盛衰兴亡的感慨\n蝉：古人以为蝉风餐饮露高洁的象征，常以蝉的高洁表现自己品行的高洁\n5.爱情类\n红豆，莲，连理枝，比翼鸟：\n6.战争类\n长城，投笔，楼兰，柳营，请缨，羌笛7.闲适类\n五柳，东篱，三径：隐士",
            "人物类型\n友人、恋人、旅人、隐士、寒士、忠士、战士、迁客、举子、思妇等\n形象特征\n不慕权贵、豪放酒脱、傲岸不羁、心忧天下、忧国忧民、寄情山水、归隐田园、怀才不遇、壮志难酬、矢志报国、慷慨愤世、友人送别、思念故乡、寂寞孤独、献身边塞、反对征伐、爱恨情长、建功立业、悯农怜农、热爱山川、哀叹盛衰等",
            "1.明确拟人手法。\n描写事物形象的诗歌，往往把物当作人来写，从分析拟人手法入手会更容易理解诗歌的主旨。\n2.明确托物言志(象征)的手法。\n逐句概括所托之物的特征，留意是否使用了对比手法，以明确诗人所言之志。\n答题模板\n(1)概括意象特点:形象特点+情感寄托。\n(2)分析意象作用:象征义+手法+人格化形象+情感。xx事物具....的特点，象征着...的品质,渲染....的氛围，寄寓了诗....的感情。",
            "1.诗中赏画一看形，色 对、静，欣赏诗的画面头。古代许多写最诗多具有“诗中有画”的特征。欢育诗的画面美，主要从四方面着手:一是物象的组合方式，二是画面色彩;三是动态;四是静态。\n2.西中品诗由冷、现、明、暗的色调，把握诗人的情感思想。般而言， 作品所描绘的外在形象画面，具有鲜活 .明丽和品扬向上色调的，其内在形象情感则是高品乐观的:反之，外在形象画面具有阴暗.凄冷和低沉色调的，其内在形象情感则是低沉伤感的。\n3.借助意象品意境。意境是作者主观情感与自然客观物象融合的整体。江月去人只数尺，风灯照夜欲三更。沙头宿鹭联拳静，船尾跳鱼拨刺鸣。江月、风灯、宿鹭、跳鱼等意象有机地组合成清幽、静谧的意境。\n4.借助意象品情感。一曲新词酒一杯。去年天气旧亭台。夕阳西下几时回?无可奈何花落去，似曾相识燕归来。小园香径独徘徊。由坠落的夕阳、无声的落花、寻旧巢的归燕几个意象，可体会到全词的感情基调是抒写对人事变迁的无比惆怅之意。\n5.关注景物描写的角度。除动静外，还有声色、虚实、点面、远近、俯仰等。由此入手明确所写景物的特点,理解意境或情感。\n答题模板\n(1)概括意象特点:形象特点+情感寄托。\n(2)分析意象作用:象征义+手法+人格化形象+情感。xx景物具....的特点，象征...的品质，渲染....的氛围，寄寓了诗人...的感情。",
    };

    public static String[] heatrate={"336已读","18已读","134已读","96已读"};
}
